Repository: dev-ngowi/Farm-Manager-App-Frontend
Catalog: lib/l10n/app_*.arb
Languages: sw

# app_name
source: Farm Manager
sw: Meneja wa Shamba

# welcomeTitle
source: Welcome to Farm Manager
sw: Karibu kwenye Meneja wa Shamba

# welcomeSubtitle
source: Keep livestock records, request vet services, and manage your farm offline.
sw: Weka rekodi za mifugo, omba huduma za mifugo, na dhibiti shamba lako nje ya mtandao.

source: Select Language
sw: Chagua Lugha

# continueBtn
source: Continue
sw: Endelea

source: Login
sw: Ingia

# loginSubtitle
source: Welcome back! Please enter your credentials.
sw: Karibu tena! Tafadhali weka vitambulisho vyako.

# username
source: Username / Email / Phone
sw: Jina la Mtumiaji / Barua pepe / Simu

# enterUsername
source: Please enter your username, email or phone
sw: Tafadhali weka jina lako la mtumiaji, barua pepe au simu

source: Password
sw: Neno la Siri

# enterPassword
source: Please enter your password
sw: Tafadhali weka neno lako la siri

source: Forgot Password?
sw: Umesahau Neno la Siri?

# noAccount
source: Don't have an account?
sw: Huna akaunti?

source: Sign Up
sw: Jisajili

# register
source: Create Account
sw: Fungua Akaunti

# registerSubtitle
source: Fill in your details to get started.
sw: Jaza maelezo yako ili uanze.

source: First Name
sw: Jina la Kwanza

# firstnameRequired
source: First name is required
sw: Jina la kwanza linahitajika

source: Last Name
sw: Jina la Mwisho

# lastnameRequired
source: Last name is required
sw: Jina la mwisho linahitajika

source: Phone Number
sw: Nambari ya Simu

# phoneRequired
source: Phone number is required
sw: Nambari ya simu inahitajika

# validPhone
source: Enter valid TZ phone (07xxxxxxxx)
sw: Weka simu halali ya TZ (07xxxxxxxx)

# email
source: Email (Optional for Farmer)
sw: Barua pepe (Si Lazima kwa Mkulima)

# validEmail
source: Please enter a valid email
sw: Tafadhali weka barua pepe halali

# passwordLength
source: Password must be at least 6 characters
sw: Neno la siri lazima liwe na herufi zisizopungua 6

source: Confirm Password
sw: Thibitisha Neno la Siri

# passwordMatch
source: Passwords do not match
sw: Maneno ya siri hayafanani

# haveAccount
source: Already have an account?
sw: Tayari una akaunti?

source: Send Reset Link
sw: Tuma Kiungo cha Kuweka Upya

source: Reset link sent!
sw: Kiungo cha kuweka upya kimetumwa!

# forgotPasswordDesc
source: Enter your email and we'll send you a reset link.
sw: Weka barua pepe yako na tutakutumia kiungo cha kuweka upya.

# selectRoleTitle
source: Who are you?
sw: Wewe ni nani?

# selectRoleSubtitle
source: Please choose the role that best describes your work.
sw: Tafadhali chagua nafasi inayoelezea kazi yako vizuri.

source: Select
sw: Chagua

source: Farmer
sw: Mkulima

# farmerDesc
source: Manage your livestock and request vet services
sw: Dhibiti mifugo yako na uombe huduma za mifugo

# roleFarmerDesc
source: Manages crops and livestock.
sw: Anasimamia mazao na mifugo.

# vet
source: Veterinarian
sw: Daktari wa Mifugo

# vetDesc
source: Provide services and manage appointments
sw: Toa huduma na dhibiti miadi

# roleVetDesc
source: Provides animal health services.
sw: Anatoa huduma za afya ya wanyama.

source: Researcher
sw: Mtafiti

# researcherDesc
source: Access anonymized data for research
sw: Fikia data iliyofanywa kuwa siri kwa ajili ya utafiti

# roleResearcherDesc
source: Studies agricultural practices.
sw: Anasoma mazoea ya kilimo.

source: Welcome!
sw: Karibu!

# roleSelected
source: Role saved successfully
sw: Nafasi imehifadhiwa kwa mafanikio

source: Continue to App
sw: Endelea Kwenye App

source: Dashboard
sw: Dashibodi

source: Livestock
sw: Mifugo

source: Add Livestock
sw: Ongeza Mifugo

source: Health Report
sw: Ripoti ya Afya

source: Breeding Record
sw: Rekodi ya Uzalishaji

source: Sync Data
sw: Sawazisha Data

source: Offline Data
sw: Data Nje ya Mtandao

source: Syncing records...
sw: Inasawazisha rekodi...

source: Vet Requests
sw: Maombi ya Daktari wa Mifugo

source: Service Requests
sw: Maombi ya Huduma

source: Prescription
sw: Maagizo ya Dawa

source: Vet Dashboard
sw: Dashibodi ya Daktari wa Mifugo

source: Analytics
sw: Uchambuzi

source: Researcher Dashboard
sw: Dashibodi ya Mtafiti

source: Submit Data Request
sw: Wasilisha Ombi la Data

source: Chart
sw: Chati

source: Profile
sw: Profaili

source: Notifications
sw: Arifa

source: Settings
sw: Mipangilio

source: Update Language
sw: Sasisha Lugha

source: Logout
sw: Toka

source: Error
sw: Hitilafu

# networkError
source: No internet connection
sw: Hakuna muunganisho wa mtandao

# serverError
source: Server error. Please try again.
sw: Hitilafu ya seva. Tafadhali jaribu tena.

source: Invalid credentials
sw: Vitambulisho visivyo sahihi

source: Success
sw: Mafanikio

# loginSuccess
source: Login successful
sw: Kuingia kumefanikiwa

# registerSuccess
source: Registration successful
sw: Usajili umefanikiwa

# registrationComplete
source: Account created successfully!
sw: Akaunti imefunguliwa kwa mafanikio!

# chooseYourRole
source: Now choose your role to continue
sw: Sasa chagua nafasi yako ili uendelee

# dataSynced
source: Data synced successfully
sw: Data imesawazishwa kwa mafanikio

source: Request sent
sw: Ombi limetumwa

source: Today
sw: Leo

source: Yesterday
sw: Jana

source: November
sw: Novemba

source: Help
sw: Msaada

source: About
sw: Kuhusu

# version
source: Version 1.1
sw: Toleo 1.1

# developer
source: Developed by Japango
sw: Imeandaliwa na Japango

# contact
source: Contact Support
sw: Wasiliana na Msaada

source: Creating Account
sw: Inafungua Akaunti

# emailAlreadyRegistered
source: Email is Already Registered
sw: Barua pepe tayari imesajiliwa

source: Validation Error
sw: Hitilafu ya Uthibitishaji

# registrationSuccessMsg
source: Successfully Registered
sw: Usajili Umefanikiwa

# roleAssigned
source: Role Set Successfully
sw: Nafasi Imewekwa kwa Mafanikio

# noInternet
source: No internet connection
sw: Hakuna muunganisho wa mtandao

# appTagline
source: Keep your farm safe
sw: Weka shamba lako salama

source: Processing
sw: Inashughulikiwa

source: Ward
sw: Kata

source: Save Location
sw: Hifadhi Mahali

source: Capture GPS
sw: Piga GPS

source: GPS Captured
sw: GPS Imepigwa

source: District
sw: Wilaya

source: Region
sw: Mkoa

# locationSubtitle
source: This will help us provide better veterinary services near you
sw: Hii itatusaidia kutoa huduma bora za mifugo karibu nawe

source: Set your location
sw: Weka mahali pako

source: Yes Add
sw: Ndiyo Ongeza

source: No
sw: Hapana

source: Add new ward
sw: Ongeza kata mpya

source: Not Found Prompt
sw: Onyo la Kutopatikana

source: Enter Ward Name
sw: Weka Jina la Kata

source: Ward name
sw: Jina la kata

# wardNameRequired
source: Ward name is Required
sw: Jina la kata linahitajika

source: District id
sw: Kitambulisho cha Wilaya

source: Save
sw: Hifadhi

source: ✓ Now capture GPS
sw: ✓ Sasa piga GPS

source: Skip for now →
sw: Ruka kwa sasa →

source: Enter new ward name:
sw: Weka jina jipya la kata:

# wardExample
source: Example: Kilakala
sw: Mfano: Kilakala

source: Cancel
sw: Ghairi

source: Add
sw: Ongeza

source: Please enter ward name
sw: Tafadhali weka jina la kata

# addedSuccessfully
source: has been added
sw: imeongezwa

# locationSavedSuccess
source: Congratulations! Location saved successfully 🎉
sw: Hongera! Mahali pamehifadhiwa kwa mafanikio 🎉

# unknownError
source: An unknown error occurred
sw: Hitilafu isiyojulikana imetokea

# errorOccurred
source: An error occurred
sw: Hitilafu imetokea

source: Adding new ward...
sw: Inaongeza kata mpya...

source: Loading districts...
sw: Inapakia wilaya...

source: Loading wards...
sw: Inapakia kata...

source: Registration Success
sw: Usajili Umefanikiwa

source: Complete Farmer Profile
sw: Kamilisha Profaili ya Mkulima

# profileSaved
source: Profile saved successfully!
sw: Profaili imehifadhiwa kwa mafanikio!

# farmerDetailsPrompt
source: Tell us about your farm. This helps us tailor your experience.
sw: Tuambie kuhusu shamba lako. Hii inatusaidia kuboresha uzoefu wako.

source: Farm Name
sw: Jina la Shamba

# requiredField
source: Required
sw: Inahitajika

# farmPurpose
source: Main Farm Purpose
sw: Kusudi Kuu la Shamba

source: Total Land Acres
sw: Jumla ya Eka za Ardhi

# acresRangeError
source: Must be between 0.1 and 10,000
sw: Lazima iwe kati ya 0.1 na 10,000

# yearsExperience
source: Years of Farming Experience
sw: Miaka ya Uzoefu wa Kilimo

# yearsRangeError
source: Must be between 0 and 70
sw: Lazima iwe kati ya 0 na 70

source: Profile Photo (Optional)
sw: Picha ya Profaili (Si Lazima)

source: Complete Profile
sw: Kamilisha Profaili

# farmLocation
source: Select farm Location
sw: Chagua Mahali pa Shamba

source: Add New Livestock
sw: Ongeza Mifugo Mpya

source: Animal Details
sw: Maelezo ya Mnyama

source: Invalid Animal ID.
sw: Kitambulisho cha Mnyama si sahihi.

source: Error loading details:
sw: Hitilafu wakati wa kupakia maelezo:

# selectAnimalDetails
source: Select an animal to view details.
sw: Chagua mnyama kuangalia maelezo.

# animalAddedSuccess
source: Animal registered successfully!
sw: Mnyama amesajiliwa kwa mafanikio!

source: Submission failed:
sw: Kuwakilisha kumeshindwa:

source: My Livestock
sw: Mifugo Yangu

# noLivestockRecords
source: No livestock records found.
sw: Hakuna rekodi za mifugo zilizopatikana.

# pressToAdd
source: Press + to add livestock.
sw: Bonyeza + kuongeza mifugo.

source: Tag Number:
sw: Nambari ya Lebo:

source: Name:
sw: Jina:

source: Species:
sw: Spishi:

source: Breed:
sw: Aina (Breed):

source: Sex:
sw: Jinsia:

source: Date of Birth:
sw: Tarehe ya Kuzaliwa:

# essentialInfo
source: Essential Information (Required)
sw: Maelezo Muhimu (Yanahitajika)

# speciesRequired
source: Species is required.
sw: Spishi inahitajika.

# breedRequired
source: Breed is required.
sw: Aina inahitajika.

# tagNumberRequired
source: Tag number
sw: Nambari ya lebo

# weightAtBirth
source: Weight at Birth (kg)
sw: Uzito Wakati wa Kuzaliwa (kg)

# weightAtBirthRequired
source: Weight at birth
sw: Uzito wakati wa kuzaliwa

# sexRequired
source: Sex
sw: Jinsia

# statusRequired
source: Status
sw: Hali

# optionalInfo
source: Optional Information
sw: Maelezo ya Hiari

source: Name (Optional)
sw: Jina (Si Lazima)

# sireID
source: Sire ID (Optional)
sw: Kitambulisho cha Baba (Si Lazima)

# damID
source: Dam ID (Optional)
sw: Kitambulisho cha Mama (Si Lazima)

source: Purchase Date (Optional)
sw: Tarehe ya Ununuzi (Si Lazima)

source: Not specified
sw: Haijabainishwa

source: Purchase Cost (Optional)
sw: Gharama ya Ununuzi (Si Lazima)

# sourceVendor
source: Source/Vendor (Optional)
sw: Chanzo/Muuzaji (Si Lazima)

source: Register Animal
sw: Sajili Mnyama

# failedLoadDropdown
source: Failed to load dropdown data:
sw: Imeshindwa kupakia data ya chaguo:

# livestockRegisteredSuccess
source: Livestock registered successfully!
sw: Mifugo imesajiliwa kwa mafanikio!

source: Male
sw: Dume

source: Female
sw: Jike

source: Unknown
sw: Haijulikani

source: Active
sw: Inafanya kazi

source: Sold
sw: Imeuzwa

source: Dead
sw: Imekufa

source: Stolen
sw: Imeibwa

# dam
source: Dam (Female)
sw: Mama (Mnyama wa Kike)

# sire
source: Sire (Male)
sw: Baba (Mnyama wa Kiume)

source: Breeding Type
sw: Aina ya Uzalishaji

# selectDamRequired
source: Please select the dam
sw: Tafadhali chagua mama

# selectBreedingTypeRequired
source: Please select the breeding type
sw: Tafadhali chagua aina ya uzalishaji

source: Semen Code
sw: Nambari ya Mbegu

# semenCodeRequired
source: Semen code is required
sw: Nambari ya mbegu inahitajika

source: Bull Name
sw: Jina la Ng'ombe Dume

source: Breeding Date
sw: Tarehe ya Uzalishaji

# dateRequired
source: Date is required
sw: Tarehe inahitajika

source: Expected Delivery Date
sw: Tarehe Inayotarajiwa ya Kuzaa

source: Status
sw: Hali

# selectStatusRequired
source: Please select a status
sw: Tafadhali chagua hali

source: Notes
sw: Maelezo

source: Record Breeding
sw: Rekodi Uzalishaji

source: Record Birth
sw: Rekodi Kuzaliwa

source: Birth Date
sw: Tarehe ya Kuzaliwa

source: Number of Live Births
sw: Idadi ya Watoto walio Hai

# validNumberRequired
source: Please enter a valid number (must be 1 or more)
sw: Tafadhali weka nambari halali (inapaswa kuwa 1 au zaidi)

source: Birth Notes
sw: Maelezo ya Kuzaliwa

source: Finalize Birth Record
sw: Kamilisha Rekodi ya Kuzaliwa

source: Record Pregnancy Check
sw: Rekodi Ukaguzi wa Mimba

source: Check Date
sw: Tarehe ya Ukaguzi

source: Check Result
sw: Matokeo ya Ukaguzi

# checkResultPositive
source: Confirmed Pregnant
sw: Imethibitishwa Kuwa na Mimba

# checkResultNegative
source: Failed (Open)
sw: Imeshindwa (Haina Mimba)

# selectResultRequired
source: Please select a result
sw: Tafadhali chagua matokeo

source: Check Method
sw: Njia ya Ukaguzi

source: Rectal Palpation
sw: Ukaguzi wa Kawaida (Rectal Palpation)

source: Blood Test
sw: Kipimo cha Damu

# selectMethodRequired
source: Please select a check method
sw: Tafadhali chagua njia ya ukaguzi

source: Record Check
sw: Hifadhi Ukaguzi

# breedingRecordSuccess
source: Successfully to adding new breeding record
sw: Rekodi mpya ya uzalishaji imeongezwa kwa mafanikio

source: Failed to load Form
sw: Imeshindwa kupakia Fomu

# tapToLoadDropdowns
source: Tap to load dropdown
sw: Gusa ili kupakia orodha kunjuzi

# errorLoading
source: Error loading data:
sw: Hitilafu wakati wa kupakia

# noBreedingRecords
source: No breeding record
sw: Hakuna rekodi za uzalishaji

source: Loading data...
sw: Inapakia Data

# breedingRecords
source: Breeding Record
sw: Rekodi ya uzalishaji

# recordNewBreeding
source: Add new breeding records
sw: Rekodi mpya za uzalishaji

source: Breeding Record Details
sw: Maelezo ya Rekodi ya Uzalishaji

source: Record ID
sw: Kitambulisho cha Rekodi

source: Dam ID
sw: Kitambulisho cha Mama

source: Expected Delivery
sw: Ujauzito Unaotarajiwa

source: Pregnancy Check
sw: Ukaguzi wa Mimba

source: Delivery Details
sw: Maelezo ya Kujifungua

source: Delivery Date
sw: Tarehe ya Kujifungua

source: Offspring Count
sw: Idadi ya Watoto

source: Delivery Notes
sw: Vidokezo vya Kujifungua

source: None
sw: Hakuna

# noSiresAvailable
source: No sire available
sw: Hakuna baba wa mnyama

source: No Dams available
sw: Hakuna mama wa mnyama

source: Result
sw: Matokeo

source: Method
sw: Mbinu

source: Save Check
sw: Tunza tizama

source: Complete Vet Profile
sw: Kamilisha Wasifu wa Dactari

# vetDetailsPrompt
source: Tell us about your practice
sw: Tuambie kuhusu uzoefu wako

source: Submit for Approval
sw: Wasilisha kwa Idhini

source: Heat Cycles
sw: Mizunguko ya Joto

source: Deliveries
sw: Uzalishaji / Kuzaa

# noDeliveriesYet
source: No delivery records found.
sw: Hakuna rekodi za uzalishaji zilizopatikana.

# recordFirstDelivery
source: Tap + to begin recording the first delivery.
sw: Gusa + kuanza kurekodi uzalishaji wa kwanza.

source: Date
sw: Tarehe

# totalWeight
source: Total Weight (kg)
sw: Jumla ya Uzito (kg)

source: Record Delivery
sw: Rekodi Uzalishaji

source: Inseminations
sw: Mbegu Bandia / Kupandikiza

# noInseminationsYet
source: No insemination records found.
sw: Hakuna rekodi za mbegu bandia zilizopatikana.

# recordFirstInsemination
source: Tap + to begin recording the first insemination.
sw: Gusa + kuanza kurekodi mbegu bandia ya kwanza.

# recordInsemIination
source: Record Insemination
sw: Rekodi Mbegu Bandia

source: Lactations
sw: Vipindi vya Kukamua

# noLactationsYet
source: No lactation records found.
sw: Hakuna rekodi za kukamua zilizopatikana.

# recordFirstLactation
source: Tap + to begin recording the first lactation cycle.
sw: Gusa + kuanza kurekodi mzunguko wa kwanza wa kukamua.

source: Record Lactation
sw: Rekodi Kukamua

# lactationNumber
source: Lactation
sw: Mkamuo

source: Started
sw: Ilianza

# projectedDuration
source: {projectedDays} days projected
sw: Siku {projectedDays} zinatarajiwa

source: Offspring
sw: Wazao / Ndama

# noOffspringYet
source: No offspring records found.
sw: Hakuna rekodi za wazao zilizopatikana.

# recordFirstOffspring
source: Tap + to record the first birth.
sw: Gusa + kurekodi kuzaliwa kwa kwanza.

source: Record Offspring
sw: Rekodi Mzao

source: Born
sw: Amezaliwa

source: Ready to Register
sw: Tayari Kusajiliwa

source: Pregnancy Checks
sw: Vipimo vya Mimba

# noChecksYet
source: No pregnancy check records found.
sw: Hakuna rekodi za vipimo vya mimba zilizopatikana.

# recordFirstCheck
source: Tap + to record the first pregnancy scan or test result.
sw: Gusa + kurekodi skani au kipimo cha mimba cha kwanza.

source: Due Date
sw: Tarehe Inayotarajiwa Kuzalia

source: Record Insemination
sw: Rekodi Mbegu Bandia

source: Semen Inventory
sw: Hifadhi ya Mbegu za Kiume

# noSemenRecordsYet
source: No semen inventory records found.
sw: Hakuna rekodi za mbegu za kiume zilizopatikana.

# addFirstSemenRecord
source: Tap + to add the first semen inventory record.
sw: Gusa + kuongeza rekodi ya kwanza ya mbegu za kiume.

source: Add Semen Record
sw: Ongeza Rekodi ya Mbegu

source: Semen Source
sw: Chanzo cha Mbegu

# semenSourceRequired
source: Semen source is required
sw: Chanzo cha mbegu kinahitajika

source: Semen Type
sw: Aina ya Mbegu

# semenTypeRequired
source: Semen type is required
sw: Aina ya mbegu inahitajika

# semenQuantity
source: Quantity (Straws)
sw: Idadi (Majani)

# validQuantityRequired
source: Please enter a valid quantity (must be 1 or more)
sw: Tafadhali ingiza idadi halali (lazima iwe 1 au zaidi)

# semenNotes
source: Notes
sw: Maelezo

source: Save Semen Record
sw: Hifadhi Rekodi ya Mbegu

# semenRecordSuccess
source: Semen inventory record added successfully!
sw: Rekodi ya mbegu za kiume imeongezwa kwa ufanisi!

source: No data available
sw: Hakuna data inayopatikana

# pressPlusToAdd
source: Press + to add records.
sw: Bonyeza + kuongeza rekodi.

# recordFirstSemenBatch
source: Record the first semen batch to get started.
sw: Rekodi kundi la kwanza la mbegu kuanza.

source: Available Units
sw: Vitengo Vilivyobaki

source: Add Semen
sw: Ongeza Mbegu

source: Record Heat Cycle
sw: Rekodi Mzunguko wa Joto

source: Start Date
sw: Tarehe ya Kuanza

source: Heat Cycle Details
sw: Maelezo ya Mzunguko wa Joto

source: Animal ID
sw: Kitambulisho cha Mnyama

source: Details
sw: Maelezo

source: Completion Date
sw: Tarehe ya Kumalizika

source: Next Observation
sw: Uchunguzi Unaofuata

# endHeatCycle
source: End Cycle
sw: Maliza Mzunguko

source: Edit
sw: Hariri

source: Select Animal
sw: Chagua Mnyama

source: Choose Animal
sw: Chagua Mnyama

# animalRequired
source: Please select an animal.
sw: Tafadhali chagua mnyama.

source: Select Date
sw: Chagua Tarehe

source: Select Start Date
sw: Chagua Tarehe ya Kuanza

# notesPlaceholder
source: E.g., Signs observed (mucus, mounting, restlessness)
sw: Mfano: Dalili zilizochunguzwa (kamasi, kupanda, kutotulia)

# heatCycleRecorded
source: Heat cycle recorded successfully!
sw: Mzunguko wa joto umerekodiwa kwa ufanisi!

source: Observed Date
sw: Tarehe ya Kuchunguzwa

source: Select Observed Date
sw: Chagua Tarehe ya Kuchunguzwa

source: Heat Intensity
sw: Ukali wa Joto

source: Select Intensity
sw: Chagua Ukali

# intensityRequired
source: Please select the heat intensity.
sw: Tafadhali chagua ukali wa joto.

# errorFetchingDetails
source: Could not load heat cycle details.
sw: Imeshindwa kupakia maelezo ya mzunguko wa joto.

# selectAHeatCycle
source: Select a heat cycle to view details.
sw: Chagua mzunguko wa joto ili kuona maelezo.

# inseminatedStatus
source: Inseminated / Completed
sw: Amepandikizwa / Imekamilika

# activeStatus
source: Active
sw: Inaendelea

# completedStatus
source: Missed / Completed
sw: Imekosa / Imekamilika

# noNotesProvided
source: No notes provided for this cycle.
sw: Hakuna maelezo yaliyotolewa kwa mzunguko huu.

source: Next Expected
sw: Inayotarajiwa Ifuatayo

source: Intensity
sw: Ukali

source: Insemination Recorded
sw: Mbegu Bandia Imerekodiwa

source: Yes
sw: Ndiyo

source: Retry
sw: Jaribu Tena

source: No female animals available
sw: Hakuna wanyama wa kike waliopo

source: Saving...
sw: Inahifadhi...

source: Collection Date
sw: Tarehe ya Kukusanya

# dose
source: Dose (straws)
sw: Kipimo (majani)

source: Motility (%)
sw: Uwezo wa Kusonga (%)

source: Cost per Straw
sw: Gharama kwa Kijani

source: Source / Supplier
sw: Chanzo / Muuzaji

# sourceSupplierHint
source: Enter the name of the supplier or leave blank if collected on-farm
sw: Ingiza jina la muuzaji au acha wazi ikiwa imekusanywa shambani

source: Internal Bull ID
sw: Kitambulisho cha Fahali wa Ndani

# bullTag
source: Bull Tag / Ear Tag
sw: Namba ya Sikio la Fahali

source: Select Collection Date
sw: Chagua Tarehe ya Kukusanya

source: Select Breed
sw: Chagua Aina

source: Select Owned Bull
sw: Chagua Fahali wa Shamba

# fieldRequired
source: This field is required
sw: Sehemu hii inahitajika

# invalidNumber
source: Please enter a valid number
sw: Tafadhali ingiza namba halali

# invalidPercentage
source: Please enter a valid percentage (0-100)
sw: Tafadhali ingiza asilimia halali (0-100)

source: Optional Details
sw: Maelezo ya Ziada

# semenAddInfo
source: Additional Semen Information
sw: Maelezo ya Ziada ya Mbegu

# fillAllRequiredFields
source: Please fill in all required fields
sw: Tafadhali jaza sehemu zote zinazohitajika

source: Saving Semen...
sw: Inahifadhi mbegu...

# strawCode
source: Straw Code / Batch
sw: Namba ya Kijani / Kundi

source: Times Used
sw: Mara Zilizotumika

# conceptions
source: Confirmed Conceptions
sw: Mimba Zilizothibitishwa

# successRate
source: Conception Rate
sw: Kiwango cha Kushika Mimba

source: General Details
sw: Maelezo ya Jumla

# internalBullSource
source: Internal Bull / Own Collection
sw: Fahali wa Ndani / Kukusanya Shambani

source: Usage History
sw: Historia ya Matumizi

source: Not recorded
sw: Haijarekodiwa

# noUsageRecords
source: No usage records yet
sw: Hakuna rekodi za matumizi bado

source: Delete Record
sw: Futa Rekodi

# confirmDelete
source: Confirm Deletion
sw: Thibitisha Kufuta

# deleteSemenWarning
source: Are you sure you want to permanently delete this semen record? This action cannot be undone.
sw: Una uhakika unataka kufuta rekodi hii ya mbegu kabisa? Hatua hii haiwezi kutenduliwa.

source: Delete
sw: Futa

source: Used
sw: Zimetumika

source: Available
sw: Zilizobaki

source: Save Changes
sw: Hifadhi Mabadiliko

source: Edit Insemination
sw: Hariri Mbegu Bandia

source: Select Dam
sw: Chagua Mama

source: Heat Cycle
sw: Mzunguko wa Joto

source: Select Heat Cycle
sw: Chagua Mzunguko wa Joto

source: Breeding Method
sw: Njia ya Kuzalisha

source: Natural
sw: Asilia

source: AI
sw: Mbegu Bandia

source: Select Sire
sw: Chagua Baba

source: Semen Straw
sw: Kijani cha Mbegu

source: Select Semen
sw: Chagua Mbegu

source: Insemination Date
sw: Tarehe ya Kupandikiza

source: Technician
sw: Fundi

source: Breeding Details
sw: Maelezo ya Uzalishaji

source: Breeding Partner
sw: Mshirika wa Kuzalisha

source: Sire Name
sw: Jina la Baba

# detailsUnavailable
source: Details unavailable for this breeding method.
sw: Maelezo hayapatikani kwa njia hii ya uzalishaji.

# noNotes
source: No notes recorded.
sw: Hakuna maelezo yaliyorekodiwa.

source: Check Record
sw: Angalia Rekodi

# noPregnancyChecksRecorded
source: No pregnancy checks have been recorded for this insemination.
sw: Hakuna vipimo vya mimba vilivyorekodiwa kwa mbegu hii.

# deleteInsemination
source: Delete Insemination Record
sw: Futa Rekodi ya Mbegu Bandia

# deleteConfirmation
source: Are you sure you want to delete the record?
sw: Una uhakika unataka kufuta rekodi hii?

# searchInseminations
source: Search by Tag, Name, or Status
sw: Tafuta kwa Namba, Jina, au Hali

# noResultsFound
source: No results found for your search.
sw: Hakuna matokeo yaliyopatikana kwa utafutaji wako.

source: delete check
sw: Futa Kipimo
