Repository: dev-ngowi/Farm-Manager-App-Frontend
Catalog: lib/l10n/app_*.arb
Languages: sw

# deleteCheckConfirmation
source: Are you sure you want to delete the check record? This action cannot be undone.
sw: Una uhakika unataka kufuta rekodi hii ya kipimo? Hatua hii haiwezi kutenduliwa.

source: Add Pregnancy Check
sw: Ongeza Kipimo cha Mimba

source: Select Insemination
sw: Chagua Mbegu Bandia

source: Select Method
sw: Chagua Njia

source: Select Result
sw: Chagua Matokeo

source: Pregnancy Details
sw: Maelezo ya Mimba

source: Select Technician
sw: Chagua Fundi

# pregnantFieldsRequired
source: Please fill in all required fields for a positive pregnancy result
sw: Tafadhali jaza sehemu zote zinazohitajika kwa matokeo chanya ya mimba

source: Edit Pregnancy Check
sw: Hariri Kipimo cha Mimba

# searchChecks
source: Search by Tag, Name, or Result
sw: Tafuta kwa Namba, Jina, au Matokeo

source: Live Born
sw: Waliozaliwa Hai

source: Total Born
sw: Jumla ya Waliozaliwa

# searchDeliveries
source: Search by Tag, Name, or Date
sw: Tafuta kwa Namba, Jina, au Tarehe

source: delivery
sw: Uzalishaji

source: deleteDelivery
sw: Futa Uzalishaji

# deleteDeliveryConfirmation
source: Are you sure you want to delete the delivery record? This action cannot be undone and will affect related records.
sw: Una uhakika unataka kufuta rekodi hii ya uzalishaji? Hatua hii haiwezi kutenduliwa na itaathiri rekodi zinazohusiana.

source: deliverySummary
sw: Muhtasari wa Uzalishaji

source: deliveryType
sw: Aina ya Uzalishaji

source: calvingEaseScore
sw: Alama ya Ugumu wa Kuzalia

source: damConditionAfter
sw: Hali ya Mama Baada ya Kuzalia

source: offspringRecords
sw: Rekodi za Wazao

source: stillborn
sw: Waliozaliwa Wafu

source: stillbornCalf
sw: Ndama Aliyezaliwa Amekufa

source: birthWeight
sw: Uzito wa Kuzaliwa

source: colostrumIntake
sw: Unyonyeshaji wa Kolostramu

source: navelTreated
sw: Kitovu Kilichotibiwa

source: downloadPdf
sw: Pakua PDF

source: Save Delivery
sw: Hifadhi Uzalishaji

# selectInseminationRequired
source: Please select an insemination record first.
sw: Tafadhali chagua rekodi ya mbegu bandia kwanza.

# atLeastOneOffspringRequired
source: At least one offspring record is required.
sw: Angalau mzao mmoja anahitajika.

source: Select Delivery Type
sw: Chagua Aina ya Uzalishaji

# scoreEasy
source: Easy
sw: Rahisi

# scoreDifficult
source: Difficult
sw: Ngumu

source: Select Dam Condition
sw: Chagua Hali ya Mama

source: Add Offspring
sw: Ongeza Mzao

source: Remove Offspring
sw: Ondoa Mzao

source: Temporary Tag
sw: Namba ya Muda

source: Gender
sw: Jinsia

source: Birth Condition
sw: Hali ya Kuzaliwa

source: Offspring Notes
sw: Maelezo ya Mzao

source: Edit Delivery
sw: Hariri Uzalishaji

# newLabel
source: New
sw: Mpya

source: Insemination
sw: Mbegu Bandia

source: Unknown Insemination
sw: Mbegu Bandia Isiyojulikana

source: Registered
sw: Amesajiliwa

source: No temporary tag
sw: Hakuna namba ya muda

# condition
source: Stillborn
sw: Amekufa

source: Offspring not found
sw: Mzao hajapatikana

source: Loading...
sw: Inapakia...

source: Offspring Details
sw: Maelezo ya Mzao

source: Birth Event
sw: Tukio la Kuzaliwa

source: Lineage
sw: Nasaba

source: Dam Tag
sw: Namba ya Mama

source: Sire Tag
sw: Namba ya Baba

# registrationStatusRegistered
source: Registered
sw: Amesajiliwa

# registrationStatusPending
source: Pending Registration
sw: Inasubiri Usajili

source: Registered as
sw: Amesajiliwa kama

source: Livestock ID
sw: Kitambulisho cha Mifugo

source: Register Offspring
sw: Sajili Mzao

# registerOffspringMessage
source: This offspring is ready to be registered with an official tag/ID.
sw: Mzao huyu yuko tayari kusajiliwa na namba rasmi.

source: Unknown Tag
sw: Namba Isiyojulikana

# selectDeliveryContext
source: Delivery Context
sw: Muktadha wa Uzalishaji

source: Identification
sw: Utambulisho

source: Birth Metrics
sw: Vipimo vya Kuzaliwa

source: Birth Weight (kg)
sw: Uzito wa Kuzaliwa (kg)

source: Additional Notes
sw: Maelezo ya Ziada

source: Save Offspring
sw: Hifadhi Mzao

# savingOffspring
source: Saving offspring record...
sw: Inahifadhi rekodi ya mzao...

# offspringRecordSuccess
source: Offspring record saved successfully
sw: Rekodi ya mzao imehifadhiwa kwa ufanisi

# enterValidWeight
source: Please enter a valid weight
sw: Tafadhali ingiza uzito halali

source: Edit Offspring
sw: Hariri Mzao

source: Saving changes...
sw: Inahifadhi mabadiliko...

source: Delivery Context
sw: Muktadha wa Uzalishaji

# registrationInstructions
source: Enter the official livestock tag/ID to complete registration.
sw: Ingiza namba rasmi ya mifugo ili kumaliza usajili.

# newLivestockTag
source: Official Livestock Tag / ID
sw: Namba Rasmi ya Mifugo

# enterUniqueTag
source: Enter a unique tag or ID
sw: Ingiza namba ya kipekee

source: Registration Date
sw: Tarehe ya Usajili

source: Confirm Registration
sw: Thibitisha Usajili

source: Submitting registration...
sw: Inawasilisha usajili...

# statusCompleted
source: Completed
sw: Imekamilika

# totalYield
source: Total Yield (liters)
sw: Jumla ya Maziwa (lita)

source: Edit Lactation
sw: Hariri Mkamuo

source: Lactation Started
sw: Mkamuo Ulianza

source: Ongoing
sw: Unaendelea

source: Completed
sw: Imekamilika

source: Peak Date
sw: Tarehe ya Kilele

# dateAfterStartDateError
source: Date must be on or after the lactation start date.
sw: Tarehe lazima iwe baada au sawa na tarehe ya kuanza kamua.

# invalidDateError
source: Invalid date format.
sw: Tarehe si halali.

source: Dry Off Date
sw: Tarehe ya Kumaliza Kukamua

# totalMilkKg
source: Total Milk Yield (kg)
sw: Jumla ya Maziwa (kg)

# invalidNumberError
source: Please enter a valid number.
sw: Tafadhali ingiza namba halali.

# mustBePositiveError
source: Value must be positive.
sw: Thamani lazima iwe chanya.

source: Days in Milk
sw: Siku za Kukamua

# invalidIntegerError
source: Please enter a valid integer.
sw: Tafadhali ingiza namba kamili halali.

# savingLactation
source: Saving lactation record...
sw: Inahifadhi rekodi ya mkamuo...

# lactationRecordSuccess
source: Lactation record saved successfully!
sw: Rekodi ya mkamuo imehifadhiwa kwa ufanisi!

source: Animal Information
sw: Maelezo ya Mnyama

source: Key Dates
sw: Tarehe Muhimu

# initialMetrics
source: Initial Metrics (Optional)
sw: Vipimo vya Mwanzo (Hiari)

source: Lactation Details
sw: Maelezo ya Mkamuo

source: Yield Summary
sw: Muhtasari wa Mazao

source: Total Milk Produced
sw: Jumla ya Maziwa Yaliyotolewa

# lactationNotFound
source: Lactation record not found.
sw: Rekodi ya mkamuo haijapatikana.

# wardAddedSuccess
source: Ward added successfully!
sw: Wadi imeongezwa kwa ufanisi!

source: Researcher Profile
sw: Wasilisha kwa Idhini

source: Welcome, Researcher!
sw: Karibu, Mtafiti!

# researcherDetailsSubtitle
source: Complete your profile to access research tools and data.
sw: Kamilisha wasifu wako ili uweze kufikia zana na data za utafiti.

source: Affiliated Institution
sw: Taasisi Inayohusiana

source: Department
sw: Idara

source: Research Focus Area
sw: Eneo la Utafiti

source: Academic Title
sw: Cheo cha Kielimu

# researchPurpose
source: Purpose of Research
sw: Madhumuni ya Utafiti

# genericError
source: A network or server error occurred. Please try again later.
sw: Hitilafu ya mtandao au seva imetokea. Tafadhali jaribu tena baadaye.
